<a href="https://colab.research.google.com/github/wSedler/SQL/blob/main/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [93]:
# Install postgresql server
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start

# Setup a password `postgres` for username `postgres`
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

 * Starting PostgreSQL 10 database server
   ...done.
ALTER ROLE

In [94]:
from sqlalchemy import create_engine
con = create_engine('postgresql+psycopg2://postgres:postgres@localhost:5432/postgres')

In [95]:
import pandas as pd
import numpy as np

In [96]:
def select(sql):
  return pd.read_sql(sql,con)

Скачиваем данные с сайта sql-ex.ru

In [97]:
!wget https://www.sql-ex.ru/download/sql-ex-pg.sql

--2021-11-18 19:00:33--  https://www.sql-ex.ru/download/sql-ex-pg.sql
Resolving www.sql-ex.ru (www.sql-ex.ru)... 136.243.105.254, 2a01:4f8:171:ed3:ce0:a1ff:fee0:bb42
Connecting to www.sql-ex.ru (www.sql-ex.ru)|136.243.105.254|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 41053 (40K) [application/x-sql]
Saving to: ‘sql-ex-pg.sql.2’

sql-ex-pg.sql.2     100%[===================>]  40.09K  --.-KB/s    in 0s

2021-11-18 19:00:34 (244 MB/s) - ‘sql-ex-pg.sql.2’ saved [41053/41053]

In [98]:
with open('/content/sql-ex-pg.sql', 'r') as file:
  sql = file.read()

In [99]:
con.execute(sql[1:])

In [100]:
import pandas as pd

In [101]:
def select(sql):
  return pd.read_sql(sql, con)

## Задание: 1

Найдите номер модели, скорость и размер жесткого диска для всех ПК стоимостью менее 500 дол.   
Вывести: model, speed и hd

In [102]:
sql = """select model, speed, hd from PC where price < 500"""

In [103]:
select(sql)

  model  speed    hd
0  1232    500  10.0
1  1232    450   8.0
2  1232    450  10.0
3  1260    500  10.0

## Задание: 2

Найдите производителей принтеров.   
Вывести: maker

In [104]:
sql = """select distinct maker from product where type = 'Printer' """

In [105]:
select(sql)

  maker
0     A
1     D
2     E

## Задание: 3

Найдите номер модели, объем памяти и размеры экранов ПК-блокнотов, цена которых превышает 1000 дол.

In [106]:
sql = """select model, ram, screen from Laptop where price > 1000"""

In [107]:
select(sql)

  model  ram  screen
0  1750  128      14
1  1298   64      15
2  1752  128      14

## Задание: 4

Найдите все записи таблицы Printer для цветных принтеров.

In [108]:
sql = """select * from Printer where color = 'y' """

In [109]:
select(sql)

   code model color type  price
0     2  1433     y  Jet  270.0
1     3  1434     y  Jet  290.0

## Задание: 5

Найдите номер модели, скорость и размер жесткого диска ПК, имеющих 12x или 24x CD и цену менее 600 дол.

In [110]:
sql = """ select model, speed, hd from PC where (cd = '12x' or cd = '24x') and price < 600 """

In [111]:
select(sql)

  model  speed    hd
0  1232    500  10.0
1  1232    450   8.0
2  1232    450  10.0
3  1260    500  10.0

## Задание: 6

Для каждого производителя, выпускающего ПК-блокноты c объёмом жесткого диска не менее 10 Гбайт, найти скорости таких ПК-блокнотов.   
Вывод: производитель, скорость.

In [112]:
sql = """ select distinct Product.maker, Laptop.speed
from Product inner join Laptop 
on Product.model = Laptop.model
where Laptop.hd >= 10
and Product.type = 'Laptop'
 """

In [113]:
select(sql)

  maker  speed
0     A    450
1     A    600
2     A    750
3     B    750

## Задание: 7

Найдите номера моделей и цены всех имеющихся в продаже продуктов (любого типа) производителя B (латинская буква).

In [114]:
sql = """ select distinct Product.model, PC.price
from Product join PC on Product.model = PC.model 
where maker = 'B'

UNION ALL

select distinct Product.model, Laptop.price
from Product join Laptop on Product.model = Laptop.model 
where maker = 'B'

UNION ALL

select distinct Product.model, Printer.price
from Product join Printer on Product.model = Printer.model 
where maker = 'B'
"""

In [115]:
select(sql)

  model   price
0  1121   850.0
1  1750  1200.0

## Задание: 8

Найдите производителя, выпускающего ПК, но не ПК-блокноты.

In [116]:
sql = """ select distinct maker from Product
where type = 'PC'
and maker not in (
  select distinct maker from Product where type = 'Laptop'
)
"""

In [117]:
select(sql)

  maker
0     E

## Задание: 9

Найдите производителей ПК с процессором не менее 450 Мгц.   
Вывести: Maker

In [118]:
sql = """select distinct Product.maker
from Product join PC on Product.model = PC.model
where speed >= 450
"""

In [119]:
select(sql)

  maker
0     B
1     E
2     A

## Задание: 10

Найдите модели принтеров, имеющих самую высокую цену.   
Вывести: model, price

In [120]:
sql = """ select model, price from Printer
where price = (
  select max(price) from Printer
)
"""

In [121]:
select(sql)

  model  price
0  1276  400.0
1  1288  400.0

## Задание: 11

Найдите среднюю скорость ПК.

In [122]:
sql = """select avg(speed) from PC"""

In [123]:
select(sql)

          avg
0  608.333333

## Задание: 12

Найдите среднюю скорость ПК-блокнотов, цена которых превышает 1000 дол.

In [124]:
sql = """select avg(speed) from Laptop
where price > 1000
"""

In [125]:
select(sql)

     avg
0  700.0

## Задание: 13

Найдите среднюю скорость ПК, выпущенных производителем A.

In [126]:
sql = """ select avg(speed)
from Product join PC on Product.model = PC.model
where Product.maker = 'A'
"""

In [127]:
select(sql)

      avg
0  606.25

## Задание: 14

Найдите класс, имя и страну для кораблей из таблицы Ships, имеющих не менее 10 орудий.

In [128]:
sql = """ select Classes.class, Ships.name, Classes.country
from Classes join Ships on Classes.class = Ships.class
where Classes.numGuns >= 10
"""

In [129]:
select(sql)

            class            name country
0       Tennessee      California     USA
1  North Carolina  North Carolina     USA
2       Tennessee       Tennessee     USA
3  North Carolina      Washington     USA
4  North Carolina    South Dakota     USA

## Задание: 15

Найдите размеры жестких дисков, совпадающих у двух и более PC.  
 Вывести: HD

In [130]:
sql = """ select hd
from PC
group by hd
having count(hd) >= 2
"""

In [131]:
select(sql)

     hd
0   8.0
1  20.0
2   5.0
3  14.0
4  10.0

## Задание: 16

Найдите пары моделей PC, имеющих одинаковые скорость и RAM. В результате каждая пара указывается только один раз, т.е. (i,j), но не (j,i),   
Порядок вывода: модель с большим номером, модель с меньшим номером, скорость и RAM.

In [132]:
sql = """ select distinct PC.model, sub2.model, PC.speed, PC.ram
from PC join (select speed, ram from PC
              group by speed, ram
              having count(*) >= 2
              and max(model) != min(model)) as sub on PC.speed = sub.speed and PC.ram = sub.ram
        join (select PC.model, PC.speed, PC.ram
              from PC join (select speed, ram from PC
                            group by speed, ram
                            having count(*) >= 2
                            and max(model) != min(model)) as sub on PC.speed = sub.speed and PC.ram = sub.ram) as sub2 on PC.speed = sub2.speed 
                            and PC.ram = sub2.ram and PC.model > sub2.model

"""

In [133]:
select(sql)

  model model  speed  ram
0  1233  1121    750  128
1  1233  1232    500   64
2  1260  1232    500   32

## Задание: 17

Найдите модели ПК-блокнотов, скорость которых меньше скорости каждого из ПК.  
Вывести: type, model, speed

In [134]:
sql = """ select distinct Product.type, Laptop.model, Laptop.speed
from Laptop join Product on Laptop.model = Product.model
where Laptop.speed < all(select speed from PC)
"""

In [135]:
select(sql)

     type model  speed
0  Laptop  1298    350

## Задание: 18


Найдите производителей самых дешевых цветных принтеров.   
Вывести: maker, price

In [136]:
sql = """ select distinct Product.maker, Printer.price
from Product join Printer on Product.model = Printer.model
where Printer.color = 'y'
and Printer.price = (select min(price) 
                    from Printer
                    where color = 'y'
                    )
"""

In [137]:
select(sql)

  maker  price
0     D  270.0

## Задание: 19

Для каждого производителя, имеющего модели в таблице Laptop, найдите средний размер экрана выпускаемых им ПК-блокнотов.  
Вывести: maker, средний размер экрана.

In [138]:
sql = """ select Product.maker, avg(Laptop.screen)
from Product join Laptop on Product.model = Laptop.model 
group by Product.maker
"""

In [139]:
select(sql)

  maker   avg
0     B  14.0
1     C  12.0
2     A  13.0

## Задание: 20

Найдите производителей, выпускающих по меньшей мере три различных модели ПК.  
  Вывести: Maker, число моделей ПК.

In [140]:
sql = """select maker, count(model)
from Product 
where type = 'PC'
group by maker
having count(model) >= 3
"""

In [141]:
select(sql)

  maker  count
0     E      3